app/views/bookings/_form.html.erb

    <label><%= form.label :car_id %></label>
    <%= form.collection_select(:car_id, Car.all, :id, :name )%>
---
SELECT "cars".* FROM "cars"