app/views/bookings/_form.html.erb

         <div id = "car_name">
    <%= form.collection_select(:car_id, Car.where(:status => "Available"), :id, :name, {:id => 'car_name'} )%>
---
SELECT "cars".* FROM "cars" WHERE "cars"."status" = ?  [["status", "Available"]]