app/views/bookings/index.html.erb

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
            <tr>
            <% unless booking.car.blank? %>