app/views/shared/_charge_form.html.erb

SELECT "credit_cards".* FROM "credit_cards" WHERE "credit_cards"."user_id" = ?  [["user_id", 22]]
---
  <%= f.label "Last 4 digits:"  %>
  <%= f.select :card_id, current_user.credit_cards.reject{ |card| card.new_record? }.collect { |card| [card.digits, card.stripe_id] }, { include_blank: false } %>