app/controllers/bookings_controller.rb

SELECT "bookings".* FROM "bookings" ORDER BY created_at DESC
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ? ORDER BY created_at DESC  [["user_id", 4]]
---
  def index
    @adminbookings = Booking.all.order('created_at DESC')
    @bookings = Booking.where(:user_id => current_user.id).order('created_at DESC')

INSERT INTO "bookings" ("user_id", "car_id", "end_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 4], ["car_id", 3], ["end_time", "2018-09-10 16:49:00"], ["created_at", "2018-09-10 15:49:53.111345"], ["updated_at", "2018-09-10 15:49:53.111345"]]
---
  def create
    params[:booking][:user_id]= current_user.id
    params[:booking][:start_time]= DateTime.now + 15.minutes
    params[:booking][:end_time]= DateTime.now + (15 + params[:post][:end_time].to_i).minutes
    params[:booking][:price]= params[:post][:end_time].to_i
    @booking = Booking.new(booking_params)


    respond_to do |format|
      if @booking.save

UPDATE "bookings" SET "paid" = ?, "updated_at" = ? WHERE "bookings"."id" = ?  [["paid", "t"], ["updated_at", "2018-09-24 16:50:07.924823"], ["id", 60]]
---
  def update
    respond_to do |format|
      if @booking.update(booking_params)

DELETE FROM "bookings" WHERE "bookings"."id" = ?  [["id", 26]]
UPDATE "cars" SET "status" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["status", "Available"], ["updated_at", "2018-10-02 17:01:25.197288"], ["id", 3]]
---
  def destroy
    @booking.destroy
    respond_to do |format|
    @booking.car.update(status: "Available")

SELECT "bookings".* FROM "bookings" WHERE "bookings"."paid" = ? ORDER BY created_at DESC  [["paid", "f"]]
---
    def set_booking
      @booking = Booking.find(params[:id])