app/controllers/cars_controller.rb

 def index
    @cars = Car.where(:status => "Available")
    @hash = Gmaps4rails.build_markers(@cars) do |car, marker|
        marker.lat car.latitude
        marker.lng car.longitude
        marker.infowindow car.name
    end
     @admincars = Car.all
---
SELECT "cars".* FROM "cars" WHERE "cars"."status" = ?  [["status", "Available"]]
SELECT "cars".* FROM "cars"

  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save
---
INSERT INTO "cars" ("name", "make", "model", "number_plate", "color", "seat_count", "current_address", "latitude", "longitude", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @car.update(car_params)
---
UPDATE "cars" SET "current_address" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["current_address", "219, Little Lonsdale St, Melbourne"], ["latitude", "-37.810248"], ["longitude", "144.965470"], ["updated_at", "2018-08-12 07:20:58.665392"], ["id", 2]]