app/controllers/charges_controller.rb

INSERT INTO "credit_cards" ("digits", "month", "year", "created_at", "updated_at", "user_id", "stripe_id") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "credit_cards".* FROM "credit_cards" WHERE "credit_cards"."user_id" = ? AND "credit_cards"."stripe_id" = ? LIMIT ?  [["user_id", 22], ["stripe_id", "card_1DBgbcJORLfa65rImZiFjEuR"], ["LIMIT", 1]]
UPDATE "bookings" SET "paid" = ?, "updated_at" = ? WHERE "bookings"."id" = ?  [["paid", "t"], ["updated_at", "2018-09-18 20:52:31.295268"], ["id", 44]]
---
  def create
    stripe_card_id =
      if params[:credit_card].present?
        CreditCardService.new(current_user.id, card_params).create_credit_card
      else
        charge_params[:card_id]
      end

    Stripe::Charge.create(
      customer: current_user.customer_id,
      source:   stripe_card_id,
      amount:   100,
      currency: 'aud'
    )

    if params[:credit_card].present? && stripe_card_id
      current_user.credit_cards.create_with(card_params).find_or_create_by(stripe_id: stripe_card_id)
      @booking.update(paid: "true")

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]
---
  def find_product
    @booking = Booking.find(params[:booking_id])